window.data = [
    {
        "name": "Учётные записи",
        "icon": "account_circle",
        "color": "110, 80, 200",
        "items": [
            {
                "name": "Username",
                "hint": "(имя пользователя; например @cameraman)",
                "text": "от 5 до 32 символов",
                "icon": "alternate_email"
            },
            {
                "name": "Bio",
                "hint": "(описание)",
                "text": "70 символов",
                "icon": "description"
            },
            {
                "name": "Длина имени",
                "hint": "",
                "text": "от 1 до 64 символов",
                "icon": "assignment_ind"
            },
            {
                "name": "Длина фамилии",
                "hint": "",
                "text": "от 0 до 64 символов",
                "icon": "assignment"
            },
            {
                "name": "Срок самоуничтожения аккаунта",
                "hint": "(при отсутствиии активности)",
                "text": "от 1 до 12 месяцев",
                "icon": "auto_delete"
            },
            {
                "name": "Спам-бан",
                "hint": "",
                "text": "от 3 дней и выше",
                "icon": "block"
            },
            {
                "name": "Количество каналов и групп, в которых можно состоять",
                "hint": "",
                "text": "максимум 500 (включая созданные вами)",
                "icon": "groups"
            },
            {
                "name": "Длительность видеоаватара",
                "hint": "",
                "text": "до 10 секунд",
                "icon": "slow_motion_video"
            },
            {
                "name": "Приглашение пользователей",
                "hint": "в чаты и каналы",
                "text": "до 200 человек",
                "icon": "inbox"
            },
            {
                "name": "Создание групп и каналов",
                "hint": "",
                "text": "до 50 в день",
                "icon": "add"
            },
        ]
    },
    {
        "name": "Чаты и группы",
        "icon": "forum",
        "color": "244, 64, 52",
        "items": [
            {
                "name": "Число участников",
                "hint": "(лимит постоянно увеличивается)",
                "text": "до 200 000",
                "icon": "group_add"
            },
            {
                "name": "Закреплённые чаты в ленте пользователя",
                "hint": "",
                "text": "до 5 чатов или каналов + 5 секретных чатов",
                "icon": "push_pin"
            },
            {
                "name": "Название и описание группы",
                "hint": "",
                "text": "до 255 символов",
                "icon": "subject"
            },
            {
                "name": "Редактирование сообщений",
                "hint": "в чатах",
                "text": "в течение 48 часов после отправки; неограничено в Сохранённых",
                "icon": "edit"
            },
            {
                "name": "Самоуничтожение фото или видео",
                "hint": "в чатах",
                "text": "от 1 до 60 секунд",
                "icon": "shutter_speed"
            },
            {
                "name": "История действий",
                "hint": "(движения участников, сообщений и т.п.)",
                "text": "последние два дня",
                "icon": "history"
            },
            {
                "name": "Количество упоминаний",
                "hint": "в одном сообщении",
                "text": "до 50, иначе уведомления не будет",
                "icon": "alternate_email"
            },
            {
                "name": "Количество видимых сообщений",
                "hint": "в группе",
                "text": "1 000 000 последних сообщений",
                "icon": "visibility"
            },
            {
                "name": "Резервация @username после смены",
                "hint": "(время, на которое имя пользователя доступно только для его бывшего владельца)",
                "text": "около 15-30 минут",
                "icon": "timelapse"
            },
        ]
    },
    {
        "name": "Каналы",
        "icon": "campaign",
        "color": "96, 125, 139",
        "items": [
            {
                "name": "Количество публичных юзернеймов",
                "hint": "на один аккаунт",
                "text": "до 10 (включая группы)",
                "icon": "alternate_email"
            },
            {
                "name": "Длина @username",
                "hint": "",
                "text": "от 5 до 32 символов",
                "icon": "text_rotation_none"
            },
            {
                "name": "Длина названия и описания канала",
                "hint": "",
                "text": "до 255 символов",
                "icon": "description"
            },
            {
                "name": "Редактирование постов",
                "hint": "",
                "text": "неограничено",
                "icon": "edit"
            },
            {
                "name": "Количество читателей канала",
                "hint": "",
                "text": "неограничено",
                "icon": "groups"
            },
            {
                "name": "Видимые участники для создателя канала",
                "hint": "",
                "text": "200 человек",
                "icon": "visibility"
            },
            {
                "name": "Удаление канала",
                "hint": "",
                "text": "канал с более чем 1К подписчиков может быть удалён только через поддержку Telegram",
                "icon": "delete"
            },
            {
                "name": "Чтение приватного канала",
                "hint": "без подписки",
                "text": "до 5 минут раз в сутки",
                "icon": "lock"
            },
            {
                "name": "Резервация @username после смены",
                "hint": "(время, на которое имя пользователя доступно только для его бывшего владельца)",
                "text": "около 15-30 минут",
                "icon": "timelapse"
            },
        ]
    },
    {
        "name": "Сообщения",
        "icon": "message",
        "color": "0, 150, 136",
        "items": [
            {
                "name": "Длина одного сообщения",
                "hint": "",
                "text": "до 4 096 символов",
                "icon": "textsms"
            },
            {
                "name": "Описание к медиафайлам",
                "hint": "",
                "text": "до 1 024 символов",
                "icon": "loyalty"
            },
            {
                "name": "Объем отправляемых файлов",
                "hint": "",
                "text": "до 2,0 ГБ",
                "icon": "cloud_upload"
            },
            {
                "name": "Длительность видеосообщения",
                "hint": "",
                "text": "до 1 минуты",
                "icon": "motion_photos_on"
            },
            {
                "name": "Количество фотографий в одном сообщении",
                "hint": "(альбом)",
                "text": "до 10 штук",
                "icon": "dashboard"
            },
        ]
    },
    {
        "name": "Папки",
        "icon": "folder",
        "color": "156, 39, 176",
        "items": [
            {
                "name": "Количество папок",
                "hint": "",
                "text": "до 10 штук",
                "icon": "create_new_folder"
            },
            {
                "name": "Закреплённые чаты в папке",
                "hint": "",
                "text": "до 100 штук",
                "icon": "push_pin"
            },
        ]
    },
    {
        "name": "Люди рядом",
        "icon": "person_pin_circle",
        "color": "175, 180, 43",
        "items": [
            {
                "name": "Радиус видимости",
                "hint": "",
                "text": "около 12 километров",
                "icon": "track_changes"
            },
            {
                "name": "Количество отображаемых пользователей",
                "hint": "",
                "text": "до 100 человек",
                "icon": "groups"
            },
            {
                "name": "Количество отображаемых геочатов",
                "hint": "",
                "text": "до 10 ближайших",
                "icon": "forum"
            },
        ]
    },
    {
        "name": "Боты",
        "icon": "settings",
        "color": "76, 175, 80",
        "items": [
            {
                "name": "Количество ботов",
                "hint": "(созданных через @BotFather)",
                "text": "до 20 штук",
                "icon": "widgets"
            },
            {
                "name": "Длина @username",
                "hint": "для бота",
                "text": "от 5 до 32 символов",
                "icon": "alternate_email"
            },
            {
                "name": "Длина информации о боте",
                "hint": "(/setabouttext)",
                "text": "до 120 символов",
                "icon": "text_rotation_none"
            },
            {
                "name": "Длина описания бота",
                "hint": "(description)",
                "text": "до 512 символов",
                "icon": "description"
            },
            {
                "name": "Файлы отправляемые ботом",
                "hint": "(BotAPI)",
                "text": "до 50МБ",
                "icon": "cloud_upload"
            },
            {
                "name": "Файлы принимаемые ботом",
                "hint": "(BotAPI)",
                "text": "до 20МБ",
                "icon": "cloud_download"
            },
            {
                "name": "Возможность пересылки сообщений",
                "hint": "",
                "text": "до 2 000 в час",
                "icon": "forward_to_inbox"
            },
            {
                "name": "Количество кнопок",
                "hint": "",
                "text": "до 100 штук",
                "icon": "keyboard"
            },
            {
                "name": "Данные форматирования сообщения",
                "hint": "",
                "text": "до 10КБ",
                "icon": "format_shapes"
            },
            {
                "name": "Частота сообщений",
                "hint": "(может быть увеличена поддержкой)",
                "text": "до 30 сообщений в секунду; 20 сообщений в минуту для чатов и каналов",
                "icon": "speed"
            },
        ]
    },
    {
        "name": "Поиск",
        "icon": "search",
        "color": "63, 81, 181",
        "items": [
            {
                "name": "Результаты в глобальном поиске",
                "hint": "",
                "text": "до 10 элементов; до 3 на Android",
                "icon": "receipt_long"
            },
            {
                "name": "Минимальная длина запроса",
                "hint": "для глобального поиска",
                "text": "от 4 символов",
                "icon": "text_rotation_none"
            },
        ]
    },
    {
        "name": "Стикеры",
        "icon": "insert_emoticon",
        "color": "255, 152, 0",
        "items": [
            {
                "name": "Количество добавленных стикерпаков",
                "hint": "",
                "text": "до 200 штук",
                "icon": "queue"
            },
            {
                "name": "Количество избранных стикеров",
                "hint": "",
                "text": "до 5 штук",
                "icon": "star"
            },
            {
                "name": "Количество стикеров в наборе",
                "hint": "",
                "text": "до 120 для простых, до 50 для анимированных",
                "icon": "collections"
            },
            {
                "name": "Размер стикера",
                "hint": "",
                "text": "одна из сторон равна 512px, другая — 512px и меньше; строго 512x512 для анимированных",
                "icon": "crop_free"
            },
            {
                "name": "Длительность анимации",
                "hint": "",
                "text": "до 3 секунд",
                "icon": "timelapse"
            },
            {
                "name": "Размер файла стикера",
                "hint": "",
                "text": "до 512КБ для простых, до 64КБ для анимированных",
                "icon": "folder_open"
            },
        ]
    },
    {
        "name": "Telegraph",
        "icon": "article",
        "color": "3, 169, 244",
        "items": [
            {
                "name": "Количество аккаунтов",
                "hint": "в боте @telegraph",
                "text": "до 5 штук",
                "icon": "how_to_reg"
            },
            {
                "name": "Количество знаков в тексте",
                "hint": "",
                "text": "до 34 087 символов",
                "icon": "text_rotation_none"
            },
        ]
    },
];